aws/amazon-freertos/vendors/renesas/FIT/RDP_v1.15_modified/r_s12ad_rx/src/targets/rx64m/r_s12ad_rx64m.c
    return err;
}

/******************************************************************************
* Function Name: adc_en_comparator_level0
* Description  : This function sets up the comparator for level0 threshold
*                compare. The processing is identical for window except
*                for the setting of the window enable bit and the level1
*                value (ADCMPDR1).
*
* Arguments    : unit -
*                    0 or 1
*                p_cmpwin -
*                    Pointer to comparator level/window compare structure
* Return Value : ADC_SUCCESS-
*                    Successful
*                ADC_ERR_INVALID_ARG-
*                    reg_id contains an invalid value.
*                ADC_ERR_ILLEGAL_ARG-
*                    an argument is illegal based upon rest of configuration
*                ADC_ERR_TRIG_ENABLED -
*                    Cannot configure comparator while scans are running
*******************************************************************************/
static adc_err_t adc_en_comparator_level0(uint8_t   unit, adc_cmpwin_t  *p_cmpwin)
{
aregs_t         *p_regs = GET_REGS_PTR(unit);
bsp_int_ctrl_t  group_priority;

#if ADC_CFG_PARAM_CHECKING_ENABLE == 1
    if (p_cmpwin->int_priority > BSP_MCU_IPL_MAX)                   // interrupt priority only use 0 to 15
    {
        return ADC_ERR_INVALID_ARG;
    }
    if ((p_cmpwin->compare_mask & ADC_INVALID_CH_MASK(unit)) != 0)  // checking exist channel
    {
        return ADC_ERR_INVALID_ARG;
    }
    if ((p_cmpwin->inside_window_mask | p_cmpwin->compare_mask) != p_cmpwin->compare_mask)  // checking compare channel combination
    {
        return ADC_ERR_INVALID_ARG;
    }
    if (p_regs->ADCSR.BIT.DBLE == 1)                                // Comparison disable when Double trigger mode
    {
        return ADC_ERR_INVALID_ARG;
    }
    if (p_regs->ADCER.BIT.DIAGM != 0)                               // Comparison disable when Self-diagnosis mode
    {
        return ADC_ERR_INVALID_ARG;
    }
#endif

    if (p_regs->ADCSR.BIT.TRGE == 1)
    {
        return ADC_ERR_TRIG_ENABLED;    // ADST must be 0 to configure comparator
    }


    /* CONFIGURE COMPARATOR */

    p_regs->ADCMPDR0 = p_cmpwin->level_lo;      // set lo end of window or set level
    if (p_regs->ADCMPCR.BIT.WCMPE == 1)
    {
        p_regs->ADCMPDR1 = p_cmpwin->level_hi;  // set hi end of window
    }

    p_regs->ADCMPANSR0.WORD = p_cmpwin->compare_mask & 0x0FFFF;
    p_regs->ADCMPLR0.WORD = p_cmpwin->inside_window_mask & 0x0FFFF;
    if (unit == 1)
    {
        S12AD1.ADCMPANSR1.BIT.CMPS1 = (p_cmpwin->compare_mask>>16) & 0x001F;
        S12AD1.ADCMPANSER.BIT.CMPSTS = (p_cmpwin->compare_mask & ADC_MASK_TEMP) ? 1 : 0;
        S12AD1.ADCMPANSER.BIT.CMPSOC = (p_cmpwin->compare_mask & ADC_MASK_VOLT) ? 1 : 0;

        S12AD1.ADCMPLR1.BIT.CMPL1 = (p_cmpwin->inside_window_mask>>16) & 0x0001F;
        S12AD1.ADCMPLER.BIT.CMPLTS = (p_cmpwin->inside_window_mask & ADC_MASK_TEMP) ? 1 : 0;
        S12AD1.ADCMPLER.BIT.CMPLOC = (p_cmpwin->inside_window_mask & ADC_MASK_VOLT) ? 1 : 0;
    }


    /* ENABLE INTERRUPT */

    if (p_cmpwin->int_priority != 0)
    {
        group_priority.ipl = (uint32_t)(p_cmpwin->int_priority);

        R_BSP_InterruptWrite(BSP_INT_SRC_BL1_S12AD0_S12CMPI0, adc_s12cmpi0_isr);    // callback function setting(GROUPBL1.IS20)
        R_BSP_InterruptWrite(BSP_INT_SRC_BL1_S12AD1_S12CMPI1, adc_s12cmpi1_isr);    // callback function setting(GROUPBL1.IS22)
        p_regs->ADCMPCR.BIT.CMPIE = 1;              // enable interrupt in ADC
        ICU.GENBL1.LONG |= g_dcb[unit].cmpi_mask;   // enable group subvector

        /* set priority for S12CMPI interrupts */
        if (unit == 0)
        {
            R_BSP_InterruptControl(BSP_INT_SRC_BL1_S12AD0_S12CMPI0, BSP_INT_CMD_GROUP_INTERRUPT_ENABLE, (void *)&group_priority);
        }
        else
        {
            R_BSP_InterruptControl(BSP_INT_SRC_BL1_S12AD1_S12CMPI1, BSP_INT_CMD_GROUP_INTERRUPT_ENABLE, (void *)&group_priority);
        }
    }

    /* Do NOT enable GENBL1 or CMPIE here with the intention of polling the GRPBL1 bit
     * for condition met. Another driver may make the GROUPBL1 priority non-zero
     * and there will be no subvector interrupt/callback here to clear the ICU flag.
     * The result will be that the BSP will be in an "infinite loop" processing the
     * group interrupt because the flag never resets, and the app level will not run.
     */
    return ADC_SUCCESS;
}


/*****************************************************************************
* Function Name: adc_s12cmpi0_isr
* Description  : Unit0 interrupt handler (bsp GRPBL1 callback) for comparator.
* Arguments    : none
* Return Value : none
******************************************************************************/
void adc_s12cmpi0_isr(void *cb_args)
{
adc_cb_args_t   args;

    if ((g_dcb[0].callback != NULL) && (g_dcb[0].callback != FIT_NO_FUNC))
    {
        /* NOTE: S12CMPI interrupts are level-based, not edge, so there will be
         * continuous triggers while condition is met. When the condition is no
         * longer met, both the ICU.GRPBL1 flag and subvector flag are
         * automatically cleared.
         */
        args.event = ADC_EVT_CONDITION_MET;
        args.unit = 0;
        args.compare_flags = adc_get_and_clr_cmpi_flags(0);
        g_dcb[0].callback(&args);
    }
}


/*****************************************************************************
* Function Name: adc_s12cmpi1_isr
* Description  : Unit1 interrupt handler (bsp GRPBL1 callback) for comparator.
* Arguments    : none
* Return Value : none
******************************************************************************/
void adc_s12cmpi1_isr(void *cb_args)
{
adc_cb_args_t   args;

    if ((g_dcb[1].callback != NULL) && (g_dcb[1].callback != FIT_NO_FUNC))
    {
        /* NOTE: S12CMPI interrupts are level-based, not edge, so there will be
         * continuous triggers while condition is met. When the condition is no
         * longer met, both the ICU.GRPBL1 flag and subvector flag are
         * automatically cleared.
         */
        args.event = ADC_EVT_CONDITION_MET;
        args.unit = 1;
        args.compare_flags = adc_get_and_clr_cmpi_flags(1);
        g_dcb[1].callback(&args);
    }
}


/*****************************************************************************
* Function Name: adc_get_and_clr_cmpi_flags
* Description  : Returns flags for all channels/sensors that met comparator
*                condition and clears the flags for next interrupt.
* Arguments    : unit -
*                   0 or 1
* Return Value : channels/sensors that met comparator condition
******************************************************************************/
static uint32_t adc_get_and_clr_cmpi_flags(uint8_t unit)
{
uint32_t    flags;

    /* NOTE: S12CMPI interrupts are level-based, not edge, so there will be
     * continuous triggers while condition is met. Writing 0 to the flags has
     * no effect UNTIL the condition clears.
     *
     * Also, the data register for the channel/sensor will still be written to.
     * The S12CMPI interrupt does not replace it but is in addition to it.
     */

    if (unit == 0)
    {
        flags = (uint32_t)S12AD.ADCMPSR0.WORD;
        S12AD.ADCMPSR0.WORD = 0;
    }
    else
    {
        flags = (uint32_t)S12AD1.ADCMPSR0.WORD;
        S12AD1.ADCMPSR0.WORD = 0;

