aws/amazon-freertos/vendors/renesas/FIT/RDP_v1.15_modified/r_s12ad_rx/src/targets/rx64m/r_s12ad_rx64m.c
    /* INTERNAL REFERENCE VOLTAGE SENSOR */

    if ((p_config->chan_mask & ADC_MASK_VOLT) || (p_config->chan_mask_groupb & ADC_MASK_VOLT))
    {
        if (p_config->chan_mask & ADC_MASK_VOLT)
        {
            S12AD1.ADEXICR.BIT.OCSA = 1;            // select internal reference voltage output to GroupA
            S12AD1.ADEXICR.BIT.OCSB = 0;
        }
        else
        {
            S12AD1.ADEXICR.BIT.OCSA = 0;
            S12AD1.ADEXICR.BIT.OCSB = 1;            // select internal reference voltage output to GroupB
        }

        S12AD1.ADEXICR.BIT.OCSAD = (p_config->add_mask & ADC_MASK_VOLT) ? 1 : 0;
    }

    return;
}


/******************************************************************************
* Function Name: adc_enable_s12adi
* Description  : This function clears the S12ADI interrupt flag and enables
*                interrupts in the peripheral (for IR flag usage). If priority
*                is not 0, interrupts are enabled in the ICU.
*                NOTE: This has nothing to do with enabling triggers.
* Arguments    : unit -
*                   0 or 1
* Return Value : none
*******************************************************************************/
static void adc_enable_s12adi(uint8_t unit)
{

    if (unit == 0)
    {
        IR(S12ADC0,S12ADI0) = 0;            // clear flag
        S12AD.ADCSR.BIT.ADIE = 1;           // enable in peripheral
        if (IPR(S12ADC0,S12ADI0) != 0)
        {
            IEN(S12ADC0,S12ADI0) = 1;       // enable in ICU
        }
    }
    else // Unit1
    {

        IR(S12ADC1,S12ADI1) = 0;            // clear flag
        S12AD1.ADCSR.BIT.ADIE = 1;          // enable in peripheral
        if (IPR(S12ADC1,S12ADI1) != 0)
        {
            IEN(S12ADC1,S12ADI1) = 1;       // enable in ICU
        }
    }
}


/******************************************************************************
* Function Name: adc_enable_s12gbadi
* Description  : This function clears the S12GBADI interrupt flag and enables
*                interrupts in the peripheral (for IR flag usage). If priority
*                is not 0, interrupts are enabled in the ICU.
*                NOTE: This has nothing to do with enabling triggers.
* Arguments    : unit -
*                   0 or 1
* Return Value : none
*******************************************************************************/
static void adc_enable_s12gbadi(uint8_t unit)
{

    if (unit == 0)
    {
        IR(S12ADC0,S12GBADI0) = 0;            // clear flag
        S12AD.ADCSR.BIT.GBADIE = 1;           // enable in peripheral
        if (IPR(S12ADC0,S12GBADI0) != 0)
        {
            IEN(S12ADC0,S12GBADI0) = 1;       // enable in ICU
        }
    }
    else // Unit1
    {

        IR(S12ADC1,S12GBADI1) = 0;            // clear flag
        S12AD1.ADCSR.BIT.GBADIE = 1;          // enable in peripheral
        if (IPR(S12ADC1,S12GBADI1) != 0)
        {
            IEN(S12ADC1,S12GBADI1) = 1;       // enable in ICU
        }
    }
}


/*****************************************************************************
* Function Name: adc_s12adi0_isr
* Description  : Unit0 interrupt handler for normal/Group A/double trigger
*                scan complete.
* Arguments    : none
* Return Value : none
******************************************************************************/
R_PRAGMA_STATIC_INTERRUPT(adc_s12adi0_isr, VECT(S12ADC0,S12ADI0))
//#pragma interrupt adc_s12adi0_isr(vect=VECT(S12ADC0,S12ADI0), enable) // FOR TESTING ONLY!
static void adc_s12adi0_isr(void)
{
adc_cb_args_t   args;

    if ((g_dcb[0].callback != NULL) && (g_dcb[0].callback != FIT_NO_FUNC))
    {
        args.event = ADC_EVT_SCAN_COMPLETE;
        args.unit = 0;
        g_dcb[0].callback(&args);
    }
}


/*****************************************************************************
* Function Name: adc_s12adi1_isr
* Description  : Unit1 interrupt handler for normal/Group A/double trigger
*                scan complete.
* Arguments    : none
* Return Value : none
******************************************************************************/
R_PRAGMA_STATIC_INTERRUPT(adc_s12adi1_isr, VECT(S12ADC1,S12ADI1))
//#pragma interrupt adc_s12adi0_isr(vect=VECT(S12ADC1,S12ADI1), enable) // FOR TESTING ONLY!
static void adc_s12adi1_isr(void)
{
adc_cb_args_t   args;

    if ((g_dcb[1].callback != NULL) && (g_dcb[1].callback != FIT_NO_FUNC))
    {
        args.event = ADC_EVT_SCAN_COMPLETE;
        args.unit = 1;
        g_dcb[1].callback(&args);
    }
}


/*****************************************************************************
* Function Name: adc_s12gbadi0_isr
* Description  : Unit0 interrupt handler for Group B scan complete.
* Arguments    : none
* Return Value : none
******************************************************************************/
R_PRAGMA_STATIC_INTERRUPT(adc_s12gbadi0_isr, VECT(S12ADC0,S12GBADI0))
//#pragma interrupt adc_s12gbadi0_isr(vect=VECT(S12ADC0,S12GBADI0),enable)  // FOR TESTING ONLY!
static void adc_s12gbadi0_isr(void)
{
adc_cb_args_t   args;

    if ((g_dcb[0].callback != NULL) && (g_dcb[0].callback != FIT_NO_FUNC))
    {
        args.event = ADC_EVT_SCAN_COMPLETE_GROUPB;
        args.unit = 0;
        g_dcb[0].callback(&args);
    }
}


/*****************************************************************************
* Function Name: adc_s12gbadi1_isr
* Description  : Unit1 interrupt handler for Group B scan complete.
* Arguments    : none
* Return Value : none
******************************************************************************/
R_PRAGMA_STATIC_INTERRUPT(adc_s12gbadi1_isr, VECT(S12ADC1,S12GBADI1))
//#pragma interrupt adc_s12gbadi1_isr(vect=VECT(S12ADC1,S12GBADI1),enable)  // FOR TESTING ONLY!
static void adc_s12gbadi1_isr(void)
{
adc_cb_args_t   args;

    if ((g_dcb[1].callback != NULL) && (g_dcb[1].callback != FIT_NO_FUNC))
    {
        args.event = ADC_EVT_SCAN_COMPLETE_GROUPB;
        args.unit = 1;
        g_dcb[1].callback(&args);
    }
}


/******************************************************************************
* Function Name: adc_close
* Description  : This is the RX64M implementation of R_ADC_Close().
*                This function ends any scan in progress, disables interrupts,
*                and removes power to the A/D peripheral.
* Arguments    : none
* Return Value : none
*******************************************************************************/
adc_err_t adc_close(uint8_t const  unit)
{
    volatile uint8_t i;
    aregs_t     *p_regs = GET_REGS_PTR(unit);

#if ADC_CFG_PARAM_CHECKING_ENABLE == 1
    if (unit > 1)
    {
        return ADC_ERR_INVALID_ARG;
    }
#endif


    /* Stop triggers & conversions, and disable peripheral interrupts */
    if (unit == 0)
    {
        IEN(S12ADC0,S12ADI0) = 0;         // disable interrupts in ICU
        IEN(S12ADC0,S12GBADI0) = 0;       // disable interrupts in ICU

        IPR(S12ADC0,S12ADI0) = 0;         // clear interrupt priority
        IPR(S12ADC0,S12GBADI0) = 0;       // clear interrupt priority
    }
    else // Unit1
    {
        IEN(S12ADC1,S12ADI1) = 0;         // disable interrupts in ICU
        IEN(S12ADC1,S12GBADI1) = 0;       // disable interrupts in ICU

        IPR(S12ADC1,S12ADI1) = 0;         // clear interrupt priority
        IPR(S12ADC1,S12GBADI1) = 0;       // clear interrupt priority
    }

    /* This program does not disable IPR register of Group interrupt. Because,
       other peripheral is possible to use same vector Group interrupt. */
    IEN(ICU,GROUPBL1) = 0;                      // disable group
    ICU.GENBL1.LONG &= ~g_dcb[unit].cmpi_mask;  // disable group subvector
    p_regs->ADCMPCR.BIT.CMPIE = 0;              // disable interrupt in ADC
    if (0 != p_regs->ADCMPCR.BIT.CMPIE)         // dummy read for waiting until set the value of CMPIE
    {
        nop();
    }

    p_regs->ADGSPCR.BIT.PGS = 0;
    if (ADC_ADCS_GROUP_SCAN == p_regs->ADCSR.BIT.ADCS)
    {
        p_regs->ADSTRGR.WORD = 0x3F3F;
        p_regs->ADCSR.BIT.ADIE = 0;
        p_regs->ADCSR.BIT.GBADIE = 0;
    }
    else
    {
        p_regs->ADSTRGR.BIT.TRSA = 0x3F;
        p_regs->ADCSR.BIT.ADIE = 0;
    }

